stevenj/avr-libc3/include/avr/io/attiny24a.h
/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE       _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_PCMSK0     _SFR_MEM8 (0x0032) /* Pin Change Enable Mask 0 */
#define EXINT_PCMSK1     _SFR_MEM8 (0x0040) /* Pin Change Enable Mask 1 */
#define EXINT_MCUCR      _SFR_MEM8 (0x0055) /* MCU Control Register */
#define EXINT_GIFR       _SFR_MEM8 (0x005A) /* General Interrupt Flag register */
#define EXINT_GIMSK      _SFR_MEM8 (0x005B) /* General Interrupt Mask Register */

/* EEPROM - EEPROM (0x0000) */
#define EEPROM_BASE      _SFR_MEM8 (0x0000) /* EEPROM Base Address */
#define EEPROM_EECR      _SFR_MEM8 (0x003C) /* EEPROM Control Register */
#define EEPROM_EEDR      _SFR_MEM8 (0x003D) /* EEPROM Data Register */
#define EEPROM_EEAR      _SFR_MEM16(0x003E) /* EEPROM Address Register  Bytes */
#define EEPROM_EEARL     _SFR_MEM8 (0x003E) /* EEPROM Address Register  Bytes LOW BYTE */
#define EEPROM_EEARH     _SFR_MEM8 (0x003F) /* EEPROM Address Register  Bytes HIGH BYTE */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE         _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCSR       _SFR_MEM8 (0x0041) /* Watchdog Timer Control Register */

/* TC0 - Timer/Counter, 8-bit (0x0000) */
#define TC8_BASE         _SFR_MEM8 (0x0000) /* TC8 Base Address */
#define TC8_GTCCR        _SFR_MEM8 (0x0043) /* General Timer/Counter Control Register */
#define TC8_TCCR0A       _SFR_MEM8 (0x0050) /* Timer/Counter  Control Register A */
#define TC8_TCNT0        _SFR_MEM8 (0x0052) /* Timer/Counter0 */
#define TC8_TCCR0B       _SFR_MEM8 (0x0053) /* Timer/Counter Control Register B */
#define TC8_OCR0A        _SFR_MEM8 (0x0056) /* Timer/Counter0 Output Compare Register A */
#define TC8_TIFR0        _SFR_MEM8 (0x0058) /* Timer/Counter0 Interrupt Flag Register */
#define TC8_TIMSK0       _SFR_MEM8 (0x0059) /* Timer/Counter Interrupt Mask Register */
#define TC8_OCR0B        _SFR_MEM8 (0x005C) /* Timer/Counter0 Output Compare Register B */

/* TC1 - Timer/Counter, 16-bit (0x0000) */
#define TC16_BASE        _SFR_MEM8 (0x0000) /* TC16 Base Address */
#define TC16_TIFR1       _SFR_MEM8 (0x002B) /* Timer/Counter Interrupt Flag register */
#define TC16_TIMSK1      _SFR_MEM8 (0x002C) /* Timer/Counter1 Interrupt Mask Register */
#define TC16_TCCR1C      _SFR_MEM8 (0x0042) /* Timer/Counter1 Control Register C */
#define TC16_ICR1        _SFR_MEM16(0x0044) /* Timer/Counter1 Input Capture Register  Bytes */
#define TC16_ICR1L       _SFR_MEM8 (0x0044) /* Timer/Counter1 Input Capture Register  Bytes LOW BYTE */
#define TC16_ICR1H       _SFR_MEM8 (0x0045) /* Timer/Counter1 Input Capture Register  Bytes HIGH BYTE */
#define TC16_OCR1B       _SFR_MEM16(0x0048) /* Timer/Counter1 Output Compare Register B  Bytes */
#define TC16_OCR1BL      _SFR_MEM8 (0x0048) /* Timer/Counter1 Output Compare Register B  Bytes LOW BYTE */
#define TC16_OCR1BH      _SFR_MEM8 (0x0049) /* Timer/Counter1 Output Compare Register B  Bytes HIGH BYTE */
#define TC16_OCR1A       _SFR_MEM16(0x004A) /* Timer/Counter1 Output Compare Register A  Bytes */
#define TC16_OCR1AL      _SFR_MEM8 (0x004A) /* Timer/Counter1 Output Compare Register A  Bytes LOW BYTE */
#define TC16_OCR1AH      _SFR_MEM8 (0x004B) /* Timer/Counter1 Output Compare Register A  Bytes HIGH BYTE */
#define TC16_TCNT1       _SFR_MEM16(0x004C) /* Timer/Counter1  Bytes */
#define TC16_TCNT1L      _SFR_MEM8 (0x004C) /* Timer/Counter1  Bytes LOW BYTE */
#define TC16_TCNT1H      _SFR_MEM8 (0x004D) /* Timer/Counter1  Bytes HIGH BYTE */
#define TC16_TCCR1B      _SFR_MEM8 (0x004E) /* Timer/Counter1 Control Register B */
#define TC16_TCCR1A      _SFR_MEM8 (0x004F) /* Timer/Counter1 Control Register A */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE         _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_PRR          _SFR_MEM8 (0x0020) /* Power Reduction Register */
#define CPU_GPIOR0       _SFR_MEM8 (0x0033) /* General Purpose I/O Register 0 */
#define CPU_GPIOR1       _SFR_MEM8 (0x0034) /* General Purpose I/O Register 1 */
#define CPU_GPIOR2       _SFR_MEM8 (0x0035) /* General Purpose I/O Register 2 */
#define CPU_CLKPR        _SFR_MEM8 (0x0046) /* Clock Prescale Register */
#define CPU_OSCCAL       _SFR_MEM8 (0x0051) /* Oscillator Calibration Value */
#define CPU_MCUSR        _SFR_MEM8 (0x0054) /* MCU Status Register */
#define CPU_MCUCR        _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_SPL          _SFR_MEM8 (0x005D) /* Stack Pointer Low */
#define CPU_SREG         _SFR_MEM8 (0x005F) /* Status Register */

/* BOOT_LOAD - Bootloader (0x0000) */
#define BOOT_LOAD_BASE   _SFR_MEM8 (0x0000) /* BOOT_LOAD Base Address */
#define BOOT_LOAD_SPMCSR _SFR_MEM8 (0x0057) /* Store Program Memory Control Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE        _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW         _SFR_MEM8 (0x0000) 
#define FUSE_HIGH        _SFR_MEM8 (0x0001) 
#define FUSE_EXTENDED    _SFR_MEM8 (0x0002) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE     _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT  _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num      (0)                 
#define None_RESET_vect          _VECTOR(0)          /* External Pin, Power-on Reset, Brown-out Reset,Watchdog Reset */
#define None_EXT_INT0_vect_num   (1)                 
#define None_EXT_INT0_vect       _VECTOR(1)          /* External Interrupt Request 0 */
#define None_PCINT0_vect_num     (2)                 
#define None_PCINT0_vect         _VECTOR(2)          /* Pin Change Interrupt Request 0 */
#define None_PCINT1_vect_num     (3)                 
#define None_PCINT1_vect         _VECTOR(3)          /* Pin Change Interrupt Request 1 */
#define None_WDT_vect_num        (4)                 
#define None_WDT_vect            _VECTOR(4)          /* Watchdog Time-out */
#define None_TIM1_CAPT_vect_num  (5)                 
#define None_TIM1_CAPT_vect      _VECTOR(5)          /* Timer/Counter1 Capture Event */
#define None_TIM1_COMPA_vect_num (6)                 
#define None_TIM1_COMPA_vect     _VECTOR(6)          /* Timer/Counter1 Compare Match A */
#define None_TIM1_COMPB_vect_num (7)                 
#define None_TIM1_COMPB_vect     _VECTOR(7)          /* Timer/Counter1 Compare Match B */
#define None_TIM1_OVF_vect_num   (8)                 
#define None_TIM1_OVF_vect       _VECTOR(8)          /* Timer/Counter1 Overflow */
#define None_TIM0_COMPA_vect_num (9)                 
#define None_TIM0_COMPA_vect     _VECTOR(9)          /* Timer/Counter0 Compare Match A */
#define None_TIM0_COMPB_vect_num (10)                
#define None_TIM0_COMPB_vect     _VECTOR(10)         /* Timer/Counter0 Compare Match B */
#define None_TIM0_OVF_vect_num   (11)                
#define None_TIM0_OVF_vect       _VECTOR(11)         /* Timer/Counter0 Overflow */
#define None_ANA_COMP_vect_num   (12)                
#define None_ANA_COMP_vect       _VECTOR(12)         /* Analog Comparator */
#define None_ADC_vect_num        (13)                
#define None_ADC_vect            _VECTOR(13)         /* ADC Conversion Complete */
#define None_EE_RDY_vect_num     (14)                
#define None_EE_RDY_vect         _VECTOR(14)         /* EEPROM Ready */
#define None_USI_STR_vect_num    (15)                
#define None_USI_STR_vect        _VECTOR(15)         /* USI START */
#define None_USI_OVF_vect_num    (16)                
#define None_USI_OVF_vect        _VECTOR(16)         /* USI Overflow */

/* Vector Table Size */
#define _VECTOR_SIZE             (2)                 /* Size of individual vector. */
#define _VECTORS_SIZE            (17 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START   (0x0000)                           
#define PROGMEM_SIZE    (0x0800)                           
#define PROGMEM_END     (PROGMEM_START + PROGMEM_SIZE - 1) 

